Config/InformationRegisters/эркасИдентификаторыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>эркасИдентификаторыТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>IMEI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>real_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/эркасПоказателиПутевыхЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>эркасПоказателиПутевыхЛистов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаправленоТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СлитоТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокТопливоПриВозвращении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Моточасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/CommonModules/эркасОбщийМодуль/Ext/Module.bsl
//регистрируем путевые листы (в плане обмена)
Процедура ПриЗаписиДокумента(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзменения(Источник);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменения(Объект)
	
	Если Объект.ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	
	ТипОбъекта = ТипЗнч(Объект);
		
	Если ТипОбъекта = Тип("ДокументОбъект.уатПутевойЛист") Тогда
		
		Если Объект.ПометкаУдаления Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ Объект.Рассчитан Тогда
			Возврат;
		КонецЕсли;	
		
		Если НЕ ИмеетсяИдентификаторТС(Объект) Тогда 
			Возврат;
		КонецЕсли;
				
		МассивУзлов = ПолучитьОбрабатываемыеУзлыПланаОбмена(МассивУзлов);
		Для Каждого Узел Из МассивУзлов Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Объект.Ссылка);
		КонецЦикла;
			
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьОбрабатываемыеУзлыПланаОбмена(МассивУзлов) Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	эркасПутевыеЛисты.Ссылка КАК Узел
	               |ИЗ
	               |	ПланОбмена.эркасПутевыеЛисты КАК эркасПутевыеЛисты
	               |ГДЕ
	               |	эркасПутевыеЛисты.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Узел =  ПланыОбмена.эркасПутевыеЛисты.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;
		
		МассивУзлов.Добавить(Выборка.Узел);
		
	КонецЦикла;	
	
	Возврат МассивУзлов;
	
КонецФункции

Функция ИмеетсяИдентификаторТС(ДокументОбъект)
	
	ТС = ДокументОбъект.ТранспортноеСредство;
	Если НЕ ЗначениеЗаполнено(ТС) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	эркасИдентификаторыТС.real_id КАК real_id
	               |ИЗ
	               |	РегистрСведений.эркасИдентификаторыТС КАК эркасИдентификаторыТС
	               |ГДЕ
	               |	эркасИдентификаторыТС.ТС = &ТС";
	Запрос.УстановитьПараметр("ТС", ТС);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ СокрЛП(Выборка.real_id)="" Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции	


//запрашиваем данные по путевым листам
Процедура ЗагрузитьПоказателиПутевыхЛистов() Экспорт
	
	ВыборкаУзлов = ПолучитьИзмененияДокументовПоУзламПланаОбмана();
		
	Пока ВыборкаУзлов.Следующий() Цикл
		
		ТекУзел = ВыборкаУзлов.Узел;
		
		ВыборкаЗаписей = ВыборкаУзлов.Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			ТекДокумент = ВыборкаЗаписей.Ссылка;
			ТекУзел = ВыборкаЗаписей.Узел;
			
			Если ВыборкаЗаписей.ПометкаУдаления Тогда
				УдалитьРегистрациюДокумента(ТекУзел, ТекДокумент);
				Продолжить;
			КонецЕсли;	

			ПолучитьИнформациюПоПутевомуЛисту(ТекУзел, ТекДокумент);
			
		КонецЦикла;
				
	КонецЦикла;	

	
КонецПроцедуры	

Функция ПолучитьИзмененияДокументовПоУзламПланаОбмана() 
	
	МассивУзлов = ПолучитьОбрабатываемыеУзлыПланаОбмена(МассивУзлов);
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатПутевойЛистИзменения.Узел КАК Узел,
	               |	уатПутевойЛист.Ссылка КАК Ссылка,
	               |	уатПутевойЛист.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Документ.уатПутевойЛист.Изменения КАК уатПутевойЛистИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатПутевойЛист КАК уатПутевойЛист
	               |		ПО уатПутевойЛистИзменения.Ссылка = уатПутевойЛист.Ссылка
	               |ГДЕ
	               |	уатПутевойЛистИзменения.Узел В(&МассивУзлов)
	               |ИТОГИ ПО
	               |	Узел";
	
	Запрос.УстановитьПараметр("МассивУзлов", МассивУзлов);
		
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции	

Функция УдалитьРегистрациюДокумента(УзелОбмена, ДокументСсылка) 
	Попытка
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ДокументСсылка);
	Исключение
	КонецПопытки;	
КонецФункции	

Функция ПолучитьИдентиыфикаторТС(ТС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	эркасИдентификаторыТС.real_id КАК real_id
	               |ИЗ
	               |	РегистрСведений.эркасИдентификаторыТС КАК эркасИдентификаторыТС
	               |ГДЕ
	               |	эркасИдентификаторыТС.ТС = &ТС";
	Запрос.УстановитьПараметр("ТС", ТС);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		real_id = СокрЛП(Выборка.real_id);
		Если НЕ real_id = "" Тогда
			Возврат real_id;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции	

Процедура ПолучитьИнформациюПоПутевомуЛисту(УзелОбмена, ДокументСсылка)
		
	ТС = ДокументСсылка.ТранспортноеСредство;
	Если НЕ ЗначениеЗаполнено(ТС) Тогда
		УдалитьРегистрациюДокумента(УзелОбмена, ДокументСсылка);
		Возврат;
	КонецЕсли;	
	
	real_id = ПолучитьИдентиыфикаторТС(ТС);
	Если real_id = Неопределено Тогда
		УдалитьРегистрациюДокумента(УзелОбмена, ДокументСсылка);
		Возврат;	
	КонецЕсли;	
	
	эркасОбработка = Обработки.эркасОбменДанными.Создать();
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить("fuelings"); //Объем заправки
	МассивПоказателей.Добавить("drains");  //Объем сливов
	МассивПоказателей.Добавить("all_fuel");//Общий расход топлива
	МассивПоказателей.Добавить("stop_fuel_level"); //Уровень топлива на конец периода
	МассивПоказателей.Добавить("motohours"); //Моточасы в секундах
	МассивПоказателей.Добавить("dist"); //Пробег в километрах
	
	ДанныеФМ = эркасОбработка.ПолучитьДанныеДляПостроенияОтчета(real_id, ДокументСсылка.ДатаВыезда, ДокументСсылка.ДатаВозвращения, МассивПоказателей); 
	Если ДанныеФМ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьПоказателиПутевогоЛистаФМ(УзелОбмена, ДокументСсылка, ДанныеФМ);
	
КонецПроцедуры

Процедура ЗафиксироватьПоказателиПутевогоЛистаФМ(УзелОбмена, ДокументСсылка, ПоказателиФМ)
	
	Для Каждого ДанныеТС Из ПоказателиФМ Цикл
		
		//oid = Формат(ДанныеТС.oid, "ЧГ=0");		
		//obj_name = ДанныеТС.obj_name;	
		
		Для Каждого ЭлПериод Из ДанныеТС.periods Цикл
			
			Если ЭлПериод.isTotal = Истина Тогда  //итог по периоду - не нужен
				Продолжить;
			КонецЕсли;	
			
			
			fuelings 	= 0;
			drains 		= 0;
			all_fuel 	= 0;
			stop_fuel_level = 0;
			motohours 	= 0;
			dist 		= 0;
			
			Для Каждого ЭлПоказатель Из ЭлПериод.prms Цикл
				
				Если ЭлПоказатель.name = "fuelings" Тогда
					fuelings = Строка2Число(ЭлПоказатель.value);
				ИначеЕсли ЭлПоказатель.name = "drains" Тогда	
					drains = Строка2Число(ЭлПоказатель.value);	
				ИначеЕсли ЭлПоказатель.name = "all_fuel" Тогда	
					all_fuel = Строка2Число(ЭлПоказатель.value);	
				ИначеЕсли ЭлПоказатель.name = "stop_fuel_level" Тогда	
					stop_fuel_level = Строка2Число(ЭлПоказатель.value);	
				ИначеЕсли ЭлПоказатель.name = "motohours" Тогда	
					motohours = Строка2Число(ЭлПоказатель.value);	
				ИначеЕсли ЭлПоказатель.name = "dist" Тогда	
					dist = Строка2Число(ЭлПоказатель.value);		
				КонецЕсли;	
											
			КонецЦикла;
			
			НаборЗаписей = РегистрыСведений.эркасПоказателиПутевыхЛистов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПутевойЛист.Установить(ДокументСсылка);	
			НоваяЗапись	= НаборЗаписей.Добавить();
			
			НоваяЗапись.ПутевойЛист = ДокументСсылка;
			НоваяЗапись.Дата 		= ТекущаяДата();
			НоваяЗапись.ЗаправленоТоплива = fuelings;
			НоваяЗапись.СлитоТоплива 	= drains;
			НоваяЗапись.РасходТоплива 	= all_fuel;
			НоваяЗапись.ОстатокТопливоПриВозвращении = stop_fuel_level;
			НоваяЗапись.Моточасы		= motohours;
			НоваяЗапись.Пробег 			= dist;
			
			Попытка
				НаборЗаписей.Записать();
				УдалитьРегистрациюДокумента(УзелОбмена, ДокументСсылка);
			Исключение
				//Ошибка
			КонецПопытки;
       			
		КонецЦикла;	
		
	КонецЦикла;
	

	
КонецПроцедуры	

Функция Строка2Число(Стр)
	Попытка 
		Возврат Число(Стр);
	Исключение
		Возврат 0;
	КонецПопытки;	
КонецФункции
